08/pgbench_default.log
pgbench (14.5)
starting vacuum...end.
progress: 10.0 s, 507.0 tps, lat 15.732 ms stddev 9.396
progress: 20.0 s, 535.5 tps, lat 14.933 ms stddev 6.718
progress: 30.0 s, 514.3 tps, lat 15.546 ms stddev 7.615
progress: 40.0 s, 429.7 tps, lat 18.616 ms stddev 14.912
progress: 50.0 s, 545.5 tps, lat 14.657 ms stddev 7.203
progress: 60.0 s, 547.7 tps, lat 14.603 ms stddev 6.921
progress: 70.0 s, 491.8 tps, lat 16.262 ms stddev 9.273
progress: 80.0 s, 575.7 tps, lat 13.882 ms stddev 6.329
progress: 90.0 s, 549.3 tps, lat 14.566 ms stddev 6.539
progress: 100.0 s, 452.1 tps, lat 17.689 ms stddev 10.776
progress: 110.0 s, 549.2 tps, lat 14.561 ms stddev 7.278
progress: 120.0 s, 607.9 tps, lat 13.156 ms stddev 5.667
progress: 130.0 s, 546.2 tps, lat 14.641 ms stddev 7.763
progress: 140.0 s, 599.7 tps, lat 13.334 ms stddev 5.640
progress: 150.0 s, 529.5 tps, lat 15.103 ms stddev 7.418
progress: 160.0 s, 485.7 tps, lat 16.465 ms stddev 9.823
progress: 170.0 s, 560.3 tps, lat 14.267 ms stddev 6.463
progress: 180.0 s, 553.9 tps, lat 14.411 ms stddev 6.779
progress: 190.0 s, 513.4 tps, lat 15.610 ms stddev 8.593
progress: 200.0 s, 584.4 tps, lat 13.684 ms stddev 8.705
progress: 210.0 s, 494.5 tps, lat 16.170 ms stddev 7.669
progress: 220.0 s, 454.9 tps, lat 17.578 ms stddev 11.436
progress: 230.0 s, 524.8 tps, lat 15.241 ms stddev 7.938
progress: 240.0 s, 570.5 tps, lat 14.018 ms stddev 6.437
progress: 250.0 s, 521.4 tps, lat 15.337 ms stddev 8.446
progress: 260.0 s, 592.2 tps, lat 13.502 ms stddev 8.989
progress: 270.0 s, 562.5 tps, lat 14.218 ms stddev 6.802
progress: 280.0 s, 486.7 tps, lat 16.431 ms stddev 10.718
progress: 290.0 s, 561.9 tps, lat 14.230 ms stddev 7.006
progress: 300.0 s, 540.3 tps, lat 14.791 ms stddev 7.382
progress: 310.0 s, 493.1 tps, lat 16.232 ms stddev 12.640
progress: 320.0 s, 604.1 tps, lat 13.216 ms stddev 5.658
progress: 330.0 s, 574.0 tps, lat 13.954 ms stddev 6.660
progress: 340.0 s, 445.4 tps, lat 17.953 ms stddev 13.500
progress: 350.0 s, 528.7 tps, lat 15.124 ms stddev 7.714
progress: 360.0 s, 427.9 tps, lat 18.661 ms stddev 9.150
progress: 370.0 s, 464.9 tps, lat 17.232 ms stddev 8.887
progress: 380.0 s, 603.3 tps, lat 13.255 ms stddev 5.818
progress: 390.0 s, 566.4 tps, lat 14.119 ms stddev 6.675
progress: 400.0 s, 472.0 tps, lat 16.940 ms stddev 13.238
progress: 410.0 s, 539.4 tps, lat 14.827 ms stddev 8.725
progress: 420.0 s, 542.9 tps, lat 14.714 ms stddev 7.064
progress: 430.0 s, 427.4 tps, lat 18.725 ms stddev 11.179
progress: 440.0 s, 589.1 tps, lat 13.580 ms stddev 5.946
progress: 450.0 s, 564.9 tps, lat 14.155 ms stddev 6.369
progress: 460.0 s, 465.7 tps, lat 17.163 ms stddev 13.138
progress: 470.0 s, 537.6 tps, lat 14.884 ms stddev 7.130
progress: 480.0 s, 573.1 tps, lat 13.953 ms stddev 6.065
progress: 490.0 s, 508.3 tps, lat 15.731 ms stddev 9.559
progress: 500.0 s, 605.3 tps, lat 13.213 ms stddev 5.645
progress: 510.0 s, 525.8 tps, lat 15.212 ms stddev 7.756
progress: 520.0 s, 479.0 tps, lat 16.694 ms stddev 10.147
progress: 530.0 s, 553.7 tps, lat 14.441 ms stddev 9.522
progress: 540.0 s, 590.2 tps, lat 13.536 ms stddev 5.890
progress: 550.0 s, 509.5 tps, lat 15.712 ms stddev 9.066
progress: 560.0 s, 597.4 tps, lat 13.378 ms stddev 5.597
progress: 570.0 s, 586.1 tps, lat 13.650 ms stddev 6.163
progress: 580.0 s, 459.2 tps, lat 17.417 ms stddev 9.737
progress: 590.0 s, 482.3 tps, lat 16.579 ms stddev 8.392
progress: 600.0 s, 519.4 tps, lat 15.392 ms stddev 7.215
progress: 610.0 s, 536.5 tps, lat 14.913 ms stddev 7.416
progress: 620.0 s, 593.4 tps, lat 13.475 ms stddev 5.861
progress: 630.0 s, 572.4 tps, lat 13.963 ms stddev 6.301
progress: 640.0 s, 466.7 tps, lat 17.147 ms stddev 10.743
progress: 650.0 s, 537.6 tps, lat 14.870 ms stddev 7.242
progress: 660.0 s, 523.2 tps, lat 15.274 ms stddev 7.091
progress: 670.0 s, 559.7 tps, lat 14.301 ms stddev 7.041
progress: 680.0 s, 579.0 tps, lat 13.812 ms stddev 6.432
progress: 690.0 s, 590.5 tps, lat 13.535 ms stddev 6.178
progress: 700.0 s, 492.3 tps, lat 16.252 ms stddev 10.393
progress: 710.0 s, 540.2 tps, lat 14.805 ms stddev 6.955
progress: 720.0 s, 584.6 tps, lat 13.673 ms stddev 5.797
progress: 730.0 s, 516.6 tps, lat 15.486 ms stddev 8.256
progress: 740.0 s, 492.1 tps, lat 16.249 ms stddev 7.227
progress: 750.0 s, 553.3 tps, lat 14.446 ms stddev 6.868
progress: 760.0 s, 412.8 tps, lat 19.383 ms stddev 12.842
progress: 770.0 s, 573.6 tps, lat 13.942 ms stddev 6.230
progress: 780.0 s, 559.9 tps, lat 14.273 ms stddev 6.579
progress: 790.0 s, 463.0 tps, lat 17.284 ms stddev 10.585
progress: 800.0 s, 576.8 tps, lat 13.863 ms stddev 6.108
progress: 810.0 s, 512.5 tps, lat 15.596 ms stddev 7.307
progress: 820.0 s, 456.1 tps, lat 17.544 ms stddev 10.837
progress: 830.0 s, 551.6 tps, lat 14.495 ms stddev 6.357
progress: 840.0 s, 580.2 tps, lat 13.786 ms stddev 5.816
progress: 850.0 s, 504.3 tps, lat 15.855 ms stddev 11.956
progress: 860.0 s, 584.2 tps, lat 13.687 ms stddev 6.576
progress: 870.0 s, 551.5 tps, lat 14.500 ms stddev 6.837
progress: 880.0 s, 476.2 tps, lat 16.796 ms stddev 11.248
progress: 890.0 s, 532.3 tps, lat 15.017 ms stddev 6.840
progress: 900.0 s, 527.8 tps, lat 15.146 ms stddev 6.580
progress: 910.0 s, 471.9 tps, lat 16.957 ms stddev 8.977
progress: 920.0 s, 508.6 tps, lat 15.725 ms stddev 7.510
progress: 930.0 s, 549.6 tps, lat 14.549 ms stddev 6.727
progress: 940.0 s, 477.7 tps, lat 16.731 ms stddev 10.613
progress: 950.0 s, 556.3 tps, lat 14.386 ms stddev 6.318
progress: 960.0 s, 460.3 tps, lat 17.373 ms stddev 8.523
progress: 970.0 s, 423.9 tps, lat 18.854 ms stddev 9.469
progress: 980.0 s, 455.7 tps, lat 17.555 ms stddev 7.899
progress: 990.0 s, 416.7 tps, lat 19.195 ms stddev 8.553
progress: 1000.0 s, 352.6 tps, lat 22.677 ms stddev 14.259
progress: 1010.0 s, 406.9 tps, lat 19.644 ms stddev 9.826
progress: 1020.0 s, 393.2 tps, lat 20.341 ms stddev 9.734
progress: 1030.0 s, 377.0 tps, lat 21.228 ms stddev 11.203
progress: 1040.0 s, 419.7 tps, lat 19.052 ms stddev 8.587
progress: 1050.0 s, 450.2 tps, lat 17.769 ms stddev 8.591
progress: 1060.0 s, 396.6 tps, lat 20.164 ms stddev 11.201
progress: 1070.0 s, 458.4 tps, lat 17.445 ms stddev 8.433
progress: 1080.0 s, 489.6 tps, lat 16.327 ms stddev 7.241
progress: 1090.0 s, 463.6 tps, lat 17.261 ms stddev 9.458
progress: 1100.0 s, 533.8 tps, lat 14.985 ms stddev 6.808
progress: 1110.0 s, 475.6 tps, lat 16.803 ms stddev 8.266
progress: 1120.0 s, 457.3 tps, lat 17.498 ms stddev 10.944
progress: 1130.0 s, 550.1 tps, lat 14.534 ms stddev 6.926
progress: 1140.0 s, 516.5 tps, lat 15.484 ms stddev 6.474
progress: 1150.0 s, 436.1 tps, lat 18.339 ms stddev 11.088
progress: 1160.0 s, 488.7 tps, lat 16.364 ms stddev 7.045
progress: 1170.0 s, 508.2 tps, lat 15.739 ms stddev 6.935
progress: 1180.0 s, 439.0 tps, lat 18.219 ms stddev 12.068
progress: 1190.0 s, 553.8 tps, lat 14.432 ms stddev 6.591
progress: 1200.0 s, 584.9 tps, lat 13.678 ms stddev 6.152
progress: 1210.0 s, 486.1 tps, lat 16.451 ms stddev 9.011
progress: 1220.0 s, 576.3 tps, lat 13.870 ms stddev 6.594
progress: 1230.0 s, 496.6 tps, lat 16.098 ms stddev 7.897
progress: 1240.0 s, 347.7 tps, lat 22.994 ms stddev 13.888
progress: 1250.0 s, 423.9 tps, lat 18.874 ms stddev 8.905
progress: 1260.0 s, 294.3 tps, lat 27.179 ms stddev 13.870
progress: 1270.0 s, 356.9 tps, lat 22.416 ms stddev 13.135
progress: 1280.0 s, 475.6 tps, lat 16.816 ms stddev 7.260
progress: 1290.0 s, 459.3 tps, lat 17.412 ms stddev 7.432
progress: 1300.0 s, 418.5 tps, lat 19.102 ms stddev 12.369
progress: 1310.0 s, 517.3 tps, lat 15.467 ms stddev 7.292
progress: 1320.0 s, 583.3 tps, lat 13.709 ms stddev 5.963
progress: 1330.0 s, 538.2 tps, lat 14.862 ms stddev 7.855
progress: 1340.0 s, 568.9 tps, lat 14.045 ms stddev 6.317
progress: 1350.0 s, 492.8 tps, lat 16.238 ms stddev 7.104
progress: 1360.0 s, 439.7 tps, lat 18.184 ms stddev 13.312
progress: 1370.0 s, 556.6 tps, lat 14.367 ms stddev 6.598
progress: 1380.0 s, 586.2 tps, lat 13.643 ms stddev 5.743
progress: 1390.0 s, 511.2 tps, lat 15.648 ms stddev 8.546
progress: 1400.0 s, 557.5 tps, lat 14.338 ms stddev 6.394
progress: 1410.0 s, 490.5 tps, lat 16.308 ms stddev 8.239
progress: 1420.0 s, 438.6 tps, lat 18.234 ms stddev 12.042
progress: 1430.0 s, 492.6 tps, lat 16.235 ms stddev 9.147
progress: 1440.0 s, 533.3 tps, lat 14.988 ms stddev 6.749
progress: 1450.0 s, 459.1 tps, lat 17.425 ms stddev 9.270
progress: 1460.0 s, 473.4 tps, lat 16.891 ms stddev 7.777
progress: 1470.0 s, 418.7 tps, lat 19.102 ms stddev 8.555
progress: 1480.0 s, 370.0 tps, lat 21.621 ms stddev 12.538
progress: 1490.0 s, 456.6 tps, lat 17.514 ms stddev 9.151
progress: 1500.0 s, 463.5 tps, lat 17.250 ms stddev 7.554
progress: 1510.0 s, 387.8 tps, lat 20.628 ms stddev 12.096
progress: 1520.0 s, 481.4 tps, lat 16.606 ms stddev 6.902
progress: 1530.0 s, 448.4 tps, lat 17.841 ms stddev 9.907
progress: 1540.0 s, 411.2 tps, lat 19.449 ms stddev 10.478
progress: 1550.0 s, 452.8 tps, lat 17.663 ms stddev 8.059
progress: 1560.0 s, 452.9 tps, lat 17.657 ms stddev 8.055
progress: 1570.0 s, 432.3 tps, lat 18.503 ms stddev 9.526
progress: 1580.0 s, 477.5 tps, lat 16.746 ms stddev 14.136
progress: 1590.0 s, 489.6 tps, lat 16.335 ms stddev 7.172
progress: 1600.0 s, 403.3 tps, lat 19.821 ms stddev 13.630
progress: 1610.0 s, 522.2 tps, lat 15.321 ms stddev 6.998
progress: 1620.0 s, 531.3 tps, lat 15.051 ms stddev 6.796
progress: 1630.0 s, 500.8 tps, lat 15.970 ms stddev 8.434
progress: 1640.0 s, 555.4 tps, lat 14.394 ms stddev 6.267
progress: 1650.0 s, 534.8 tps, lat 14.958 ms stddev 6.710
progress: 1660.0 s, 443.8 tps, lat 18.018 ms stddev 11.620
progress: 1670.0 s, 521.3 tps, lat 15.332 ms stddev 7.309
progress: 1680.0 s, 535.9 tps, lat 14.930 ms stddev 7.297
progress: 1690.0 s, 525.2 tps, lat 15.229 ms stddev 8.240
progress: 1700.0 s, 570.1 tps, lat 14.028 ms stddev 6.084
progress: 1710.0 s, 483.2 tps, lat 16.547 ms stddev 8.234
progress: 1720.0 s, 439.2 tps, lat 18.214 ms stddev 12.073
progress: 1730.0 s, 523.0 tps, lat 15.291 ms stddev 7.162
progress: 1740.0 s, 562.9 tps, lat 14.208 ms stddev 6.321
progress: 1750.0 s, 547.1 tps, lat 14.610 ms stddev 7.707
progress: 1760.0 s, 581.0 tps, lat 13.767 ms stddev 6.101
progress: 1770.0 s, 535.7 tps, lat 14.922 ms stddev 7.052
progress: 1780.0 s, 440.4 tps, lat 18.164 ms stddev 11.594
progress: 1790.0 s, 540.5 tps, lat 14.797 ms stddev 6.982
progress: 1800.0 s, 538.8 tps, lat 14.843 ms stddev 7.192
progress: 1810.0 s, 502.3 tps, lat 15.919 ms stddev 8.946
progress: 1820.0 s, 594.0 tps, lat 13.464 ms stddev 5.987
progress: 1830.0 s, 552.0 tps, lat 14.486 ms stddev 7.066
progress: 1840.0 s, 462.3 tps, lat 17.296 ms stddev 9.872
progress: 1850.0 s, 559.6 tps, lat 14.291 ms stddev 6.832
progress: 1860.0 s, 554.4 tps, lat 14.423 ms stddev 6.586
progress: 1870.0 s, 486.9 tps, lat 16.416 ms stddev 9.384
progress: 1880.0 s, 552.0 tps, lat 14.496 ms stddev 6.372
progress: 1890.0 s, 555.4 tps, lat 14.399 ms stddev 6.334
progress: 1900.0 s, 489.5 tps, lat 16.334 ms stddev 9.962
progress: 1910.0 s, 538.0 tps, lat 14.866 ms stddev 7.220
progress: 1920.0 s, 587.1 tps, lat 13.620 ms stddev 5.836
progress: 1930.0 s, 502.4 tps, lat 15.918 ms stddev 8.587
progress: 1940.0 s, 602.8 tps, lat 13.266 ms stddev 5.566
progress: 1950.0 s, 574.6 tps, lat 13.916 ms stddev 5.978
progress: 1960.0 s, 489.3 tps, lat 16.345 ms stddev 9.709
progress: 1970.0 s, 561.2 tps, lat 14.246 ms stddev 6.860
progress: 1980.0 s, 575.7 tps, lat 13.887 ms stddev 5.978
progress: 1990.0 s, 508.1 tps, lat 15.743 ms stddev 8.843
progress: 2000.0 s, 554.8 tps, lat 14.413 ms stddev 5.925
progress: 2010.0 s, 498.8 tps, lat 16.035 ms stddev 7.210
progress: 2020.0 s, 468.1 tps, lat 17.085 ms stddev 10.576
progress: 2030.0 s, 537.5 tps, lat 14.874 ms stddev 7.285
progress: 2040.0 s, 525.3 tps, lat 15.223 ms stddev 6.631
progress: 2050.0 s, 532.0 tps, lat 15.038 ms stddev 7.715
progress: 2060.0 s, 574.9 tps, lat 13.905 ms stddev 6.128
progress: 2070.0 s, 490.2 tps, lat 16.312 ms stddev 7.441
progress: 2080.0 s, 436.0 tps, lat 18.342 ms stddev 10.174
progress: 2090.0 s, 534.9 tps, lat 14.952 ms stddev 7.418
progress: 2100.0 s, 555.5 tps, lat 14.402 ms stddev 6.811
progress: 2110.0 s, 525.3 tps, lat 15.218 ms stddev 7.844
progress: 2120.0 s, 585.3 tps, lat 13.664 ms stddev 5.706
progress: 2130.0 s, 581.5 tps, lat 13.753 ms stddev 5.872
progress: 2140.0 s, 493.5 tps, lat 16.201 ms stddev 9.462
progress: 2150.0 s, 540.9 tps, lat 14.786 ms stddev 7.242
progress: 2160.0 s, 556.8 tps, lat 14.362 ms stddev 6.561
progress: 2170.0 s, 538.7 tps, lat 14.845 ms stddev 8.067
progress: 2180.0 s, 611.6 tps, lat 13.076 ms stddev 5.771
progress: 2190.0 s, 516.3 tps, lat 15.487 ms stddev 11.081
progress: 2200.0 s, 410.8 tps, lat 19.461 ms stddev 10.490
progress: 2210.0 s, 559.3 tps, lat 14.306 ms stddev 6.750
progress: 2220.0 s, 570.3 tps, lat 14.020 ms stddev 6.038
progress: 2230.0 s, 490.3 tps, lat 16.311 ms stddev 9.663
progress: 2240.0 s, 590.9 tps, lat 13.532 ms stddev 6.143
progress: 2250.0 s, 556.0 tps, lat 14.383 ms stddev 6.646
progress: 2260.0 s, 461.9 tps, lat 17.314 ms stddev 10.594
progress: 2270.0 s, 544.5 tps, lat 14.685 ms stddev 6.782
progress: 2280.0 s, 550.7 tps, lat 14.522 ms stddev 6.514
progress: 2290.0 s, 485.2 tps, lat 16.481 ms stddev 9.192
progress: 2300.0 s, 603.3 tps, lat 13.243 ms stddev 5.489
progress: 2310.0 s, 521.6 tps, lat 15.345 ms stddev 7.279
progress: 2320.0 s, 479.7 tps, lat 16.672 ms stddev 10.876
progress: 2330.0 s, 552.9 tps, lat 14.467 ms stddev 7.046
progress: 2340.0 s, 585.1 tps, lat 13.665 ms stddev 6.061
progress: 2350.0 s, 507.6 tps, lat 15.755 ms stddev 9.541
progress: 2360.0 s, 583.1 tps, lat 13.715 ms stddev 5.677
progress: 2370.0 s, 534.8 tps, lat 14.950 ms stddev 10.484
progress: 2380.0 s, 490.5 tps, lat 16.306 ms stddev 10.016
progress: 2390.0 s, 530.1 tps, lat 15.082 ms stddev 7.466
progress: 2400.0 s, 534.3 tps, lat 14.970 ms stddev 6.675
progress: 2410.0 s, 500.6 tps, lat 15.972 ms stddev 9.254
progress: 2420.0 s, 597.2 tps, lat 13.395 ms stddev 5.803
progress: 2430.0 s, 551.5 tps, lat 14.499 ms stddev 6.517
progress: 2440.0 s, 466.5 tps, lat 17.132 ms stddev 10.415
progress: 2450.0 s, 542.4 tps, lat 14.748 ms stddev 7.000
progress: 2460.0 s, 491.0 tps, lat 16.287 ms stddev 7.515
progress: 2470.0 s, 452.8 tps, lat 17.668 ms stddev 13.308
progress: 2480.0 s, 543.5 tps, lat 14.716 ms stddev 6.277
progress: 2490.0 s, 569.0 tps, lat 14.052 ms stddev 6.388
progress: 2500.0 s, 485.4 tps, lat 16.475 ms stddev 9.006
progress: 2510.0 s, 523.3 tps, lat 15.284 ms stddev 7.973
progress: 2520.0 s, 586.6 tps, lat 13.630 ms stddev 6.178
progress: 2530.0 s, 521.9 tps, lat 15.324 ms stddev 8.492
progress: 2540.0 s, 560.6 tps, lat 14.259 ms stddev 6.780
progress: 2550.0 s, 553.2 tps, lat 14.463 ms stddev 6.647
progress: 2560.0 s, 478.0 tps, lat 16.725 ms stddev 9.618
progress: 2570.0 s, 536.5 tps, lat 14.910 ms stddev 6.811
progress: 2580.0 s, 548.2 tps, lat 14.581 ms stddev 6.157
progress: 2590.0 s, 470.1 tps, lat 17.016 ms stddev 9.526
progress: 2600.0 s, 536.2 tps, lat 14.917 ms stddev 6.559
progress: 2610.0 s, 485.6 tps, lat 16.462 ms stddev 7.997
progress: 2620.0 s, 465.5 tps, lat 17.183 ms stddev 10.782
progress: 2630.0 s, 522.5 tps, lat 15.308 ms stddev 7.807
progress: 2640.0 s, 580.3 tps, lat 13.783 ms stddev 6.185
progress: 2650.0 s, 514.0 tps, lat 15.558 ms stddev 8.098
progress: 2660.0 s, 588.3 tps, lat 13.592 ms stddev 5.984
progress: 2670.0 s, 542.3 tps, lat 14.747 ms stddev 7.046
progress: 2680.0 s, 441.6 tps, lat 18.093 ms stddev 13.785
progress: 2690.0 s, 554.5 tps, lat 14.433 ms stddev 6.898
progress: 2700.0 s, 582.7 tps, lat 13.716 ms stddev 5.778
progress: 2710.0 s, 494.0 tps, lat 16.196 ms stddev 8.960
progress: 2720.0 s, 587.4 tps, lat 13.612 ms stddev 5.956
progress: 2730.0 s, 552.7 tps, lat 14.462 ms stddev 6.746
progress: 2740.0 s, 455.2 tps, lat 17.579 ms stddev 12.007
progress: 2750.0 s, 543.2 tps, lat 14.716 ms stddev 6.705
progress: 2760.0 s, 543.4 tps, lat 14.722 ms stddev 6.813
progress: 2770.0 s, 499.3 tps, lat 16.016 ms stddev 9.254
progress: 2780.0 s, 541.3 tps, lat 14.769 ms stddev 6.769
progress: 2790.0 s, 529.6 tps, lat 15.103 ms stddev 10.621
progress: 2800.0 s, 464.4 tps, lat 17.222 ms stddev 10.310
progress: 2810.0 s, 563.4 tps, lat 14.191 ms stddev 6.791
progress: 2820.0 s, 524.2 tps, lat 15.255 ms stddev 6.750
progress: 2830.0 s, 523.4 tps, lat 15.285 ms stddev 7.997
progress: 2840.0 s, 530.6 tps, lat 15.070 ms stddev 53.443
progress: 2850.0 s, 602.0 tps, lat 13.284 ms stddev 6.984
progress: 2860.0 s, 553.6 tps, lat 14.439 ms stddev 9.093
progress: 2870.0 s, 539.9 tps, lat 14.814 ms stddev 8.560
progress: 2880.0 s, 635.8 tps, lat 12.581 ms stddev 6.094
progress: 2890.0 s, 591.2 tps, lat 13.527 ms stddev 8.675
progress: 2900.0 s, 639.4 tps, lat 12.506 ms stddev 6.474
progress: 2910.0 s, 571.1 tps, lat 13.995 ms stddev 7.038
progress: 2920.0 s, 504.4 tps, lat 15.863 ms stddev 12.852
progress: 2930.0 s, 627.4 tps, lat 12.745 ms stddev 7.257
progress: 2940.0 s, 653.8 tps, lat 12.230 ms stddev 6.136
progress: 2950.0 s, 546.2 tps, lat 14.637 ms stddev 9.397
progress: 2960.0 s, 631.6 tps, lat 12.662 ms stddev 6.244
progress: 2970.0 s, 576.8 tps, lat 13.864 ms stddev 7.005
progress: 2980.0 s, 498.1 tps, lat 16.055 ms stddev 11.728
progress: 2990.0 s, 555.2 tps, lat 14.406 ms stddev 8.207
progress: 3000.0 s, 572.9 tps, lat 13.959 ms stddev 7.329
progress: 3010.0 s, 541.3 tps, lat 14.774 ms stddev 9.707
progress: 3020.0 s, 636.9 tps, lat 12.554 ms stddev 6.448
progress: 3030.0 s, 614.3 tps, lat 13.011 ms stddev 6.437
progress: 3040.0 s, 488.2 tps, lat 16.377 ms stddev 12.861
progress: 3050.0 s, 606.5 tps, lat 13.180 ms stddev 6.534
progress: 3060.0 s, 614.8 tps, lat 13.019 ms stddev 6.582
progress: 3070.0 s, 564.3 tps, lat 14.173 ms stddev 9.013
progress: 3080.0 s, 640.0 tps, lat 12.492 ms stddev 6.325
progress: 3090.0 s, 563.8 tps, lat 14.176 ms stddev 7.959
progress: 3100.0 s, 502.0 tps, lat 15.938 ms stddev 10.571
progress: 3110.0 s, 583.5 tps, lat 13.709 ms stddev 7.578
progress: 3120.0 s, 673.9 tps, lat 11.864 ms stddev 5.482
progress: 3130.0 s, 585.5 tps, lat 13.653 ms stddev 8.075
progress: 3140.0 s, 618.3 tps, lat 12.935 ms stddev 7.183
progress: 3150.0 s, 563.4 tps, lat 14.197 ms stddev 7.143
progress: 3160.0 s, 431.7 tps, lat 18.523 ms stddev 14.904
progress: 3170.0 s, 439.7 tps, lat 18.192 ms stddev 10.299
progress: 3180.0 s, 616.9 tps, lat 12.959 ms stddev 6.538
progress: 3190.0 s, 586.4 tps, lat 13.639 ms stddev 8.640
progress: 3200.0 s, 685.1 tps, lat 11.671 ms stddev 5.798
progress: 3210.0 s, 562.1 tps, lat 14.228 ms stddev 7.329
progress: 3220.0 s, 500.4 tps, lat 15.977 ms stddev 15.560
progress: 3230.0 s, 595.0 tps, lat 13.440 ms stddev 8.141
progress: 3240.0 s, 634.9 tps, lat 12.591 ms stddev 6.374
progress: 3250.0 s, 555.0 tps, lat 14.416 ms stddev 9.066
progress: 3260.0 s, 652.3 tps, lat 12.257 ms stddev 6.120
progress: 3270.0 s, 601.4 tps, lat 13.300 ms stddev 6.916
progress: 3280.0 s, 467.1 tps, lat 17.109 ms stddev 12.029
progress: 3290.0 s, 595.3 tps, lat 13.440 ms stddev 7.145
progress: 3300.0 s, 620.9 tps, lat 12.879 ms stddev 7.112
progress: 3310.0 s, 529.8 tps, lat 15.095 ms stddev 10.910
progress: 3320.0 s, 654.6 tps, lat 12.203 ms stddev 5.835
progress: 3330.0 s, 540.4 tps, lat 14.803 ms stddev 8.222
progress: 3340.0 s, 497.7 tps, lat 16.069 ms stddev 10.392
progress: 3350.0 s, 513.1 tps, lat 15.594 ms stddev 9.361
progress: 3360.0 s, 595.0 tps, lat 13.437 ms stddev 6.580
progress: 3370.0 s, 583.6 tps, lat 13.707 ms stddev 8.556
progress: 3380.0 s, 665.6 tps, lat 12.013 ms stddev 5.368
progress: 3390.0 s, 627.7 tps, lat 12.737 ms stddev 6.503
progress: 3400.0 s, 473.0 tps, lat 16.910 ms stddev 13.586
progress: 3410.0 s, 583.4 tps, lat 13.705 ms stddev 8.136
progress: 3420.0 s, 636.2 tps, lat 12.569 ms stddev 6.096
progress: 3430.0 s, 545.4 tps, lat 14.665 ms stddev 9.162
progress: 3440.0 s, 663.3 tps, lat 12.054 ms stddev 6.316
progress: 3450.0 s, 623.2 tps, lat 12.830 ms stddev 6.286
progress: 3460.0 s, 496.3 tps, lat 16.109 ms stddev 10.693
progress: 3470.0 s, 559.8 tps, lat 14.286 ms stddev 8.659
progress: 3480.0 s, 618.7 tps, lat 12.924 ms stddev 6.307
progress: 3490.0 s, 558.5 tps, lat 14.319 ms stddev 9.393
progress: 3500.0 s, 671.9 tps, lat 11.903 ms stddev 5.853
progress: 3510.0 s, 495.2 tps, lat 16.149 ms stddev 9.575
progress: 3520.0 s, 510.9 tps, lat 15.648 ms stddev 11.953
progress: 3530.0 s, 584.5 tps, lat 13.688 ms stddev 9.759
progress: 3540.0 s, 651.1 tps, lat 12.278 ms stddev 5.912
progress: 3550.0 s, 543.4 tps, lat 14.716 ms stddev 9.346
progress: 3560.0 s, 632.7 tps, lat 12.641 ms stddev 5.514
progress: 3570.0 s, 547.2 tps, lat 14.614 ms stddev 7.691
progress: 3580.0 s, 461.1 tps, lat 17.343 ms stddev 14.398
progress: 3590.0 s, 550.1 tps, lat 14.533 ms stddev 8.346
progress: 3600.0 s, 608.2 tps, lat 13.152 ms stddev 6.627
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
duration: 3600 s
number of transactions actually processed: 1901060
latency average = 15.144 ms
latency stddev = 8.920 ms
initial connection time = 18.387 ms
tps = 528.072527 (without initial connection time)